// Рецепты для мини-игры "Приготовление Аладок".
// `name`: Название раунда.
// `recipe`: Объект, где ключ - название ингредиента, а значение - сколько его нужно собрать.
// `ingredients`: Массив правильных ингредиентов для этого раунда.
// `decoys`: Массив неправильных ингредиентов (ошибок).
export const ALADKI_RECIPES = [
  { // Round 1
    name: 'Аладки Мини',
    recipe: { 'МУКА': 1, 'ЯЙЦО': 2, 'САХАР': 1 },
    ingredients: ['МУКА', 'ЯЙЦО', 'САХАР'],
    decoys: ['СОЛЬ', 'ПЕРЕЦ', 'МАСЛО', 'УКСУС']
  },
  { // Round 2
    name: 'Аладки ТОП',
    recipe: { 'МУКА': 2, 'ЯЙЦО': 1, 'САХАР': 1, 'КЕФИР': 3, 'СОДА': 1, 'СОЛЬ': 1 },
    ingredients: ['МУКА', 'ЯЙЦО', 'САХАР', 'КЕФИР', 'СОДА', 'СОЛЬ'], // СОЛЬ - правильный ингредиент
    decoys: ['МУКАР', 'ЯЦОЙ', 'САХОР', 'ФАКИР', 'СОДДА', 'СЛОЬ', 'КЕИФР', 'ПЕРЕЦ', 'АЙЦО', 'САХАРЬ', 'МЮКА', 'УКСУС', 'ЛЮБОВЬ', 'ЯЙЦЫ', 'МЛЕКОО']
  },
  { // Round 3
    name: 'Дада-Соус',
    recipe: { 'ЭНТРОПИЯ': 3, 'АБСУРД': 2, 'СИМУЛЯКР': 4 },
    ingredients: ['ЭНТРОПИЯ', 'АБСУРД', 'СИМУЛЯКР'],
    decoys: ['ДИСКУРСИЯ', 'ПАРАДИМА', 'ТРИСОМА', 'ГОЛОС', 'ШОУМЕН', 'ЭНТРОПЕПА', 'АРБУЗРД', 'СМИМИЛЯКР']
  }
];
