// Слова для сборки в мини-игре "Собери Феминитив".
export const FEMINITIVES_TO_ASSEMBLE = ['ЧЕЛОВЕЧИЦА', 'СУПЕРЭГОИНЯ', 'ПОЛИГЛОТКА', 'РЕМОНТЁРКА', 'АЛКОГОЛИЦА', 'ПОЭТЕССA', 'КРИТИКЕССА', 'ДИЗАЙНЕРКА', 'ПСИХОЛОГИНЯ', 'САНТЕХНИЦА', 'ДЕПУТАТКА', 'ВРАЧИНЯ', 'ФИЛОСОФИНЯ', 'ПРЕЗИДЕНТКА', 'АБСУРДИСТКА', 'ДАДАИСТКА', 'ФИЛОСОФИНЯ', 'ГЕРОИНЯ', 'ДИРЕКТРИСА'];

// Пары слов для мини-игры "Бойцовский Клуб Феминитивов".
// `incorrect` - слово, которое летит в игрока.
// `correct` - слово, в которое оно превращается после клика.
export const FEMINITIVES_PAIRS = [
    { incorrect: 'ПИЛОТ', correct: 'ПИЛОТКА' },
    { incorrect: 'ГЛАВАРЬ', correct: 'ГЛАВАРКА' },
    { incorrect: 'ЖУК', correct: 'ЖУЧЬ' },
    { incorrect: 'ДЕКАН', correct: 'ДЕКАНЬЯ' },
    { incorrect: 'ТАМАДОР', correct: 'ТАМАДА' },
    { incorrect: 'БОСС', correct: 'БОССКА' },
    { incorrect: 'ГРИБНИК', correct: 'ГРИБНИЦА' },
    { incorrect: 'ШЕФ', correct: 'ШЕФИНЯ' },
    { incorrect: 'ЧЕЛОВЕК', correct: 'ЧЕЛОВЕЧИЦА' },
    { incorrect: 'СПОРТСМЕН', correct: 'СПОРТСВУМЕН' },
    { incorrect: 'АНГЕЛ', correct: 'АНГЕЛИHA' },
    { incorrect: 'НЯНЕР', correct: 'НЯНЯ' },
    { incorrect: 'ПОСОЛ', correct: 'ПОСЛА' },
    { incorrect: 'ШВЕЁР', correct: 'ШВЕЯ' },
    { incorrect: 'ЖУЛИК', correct: 'ЖУЛИКИНЯ' },
    { incorrect: 'БАЛБЕС', correct: 'БАЛБЕСКА' },
    { incorrect: 'МАЛЯР', correct: 'МАЛЯРИНЯ' },
    { incorrect: 'РАСТЕНИЕВОД', correct: 'РАСТЕНИЕВОДКА' },
];

// "Умные" слова для мини-игры "Дадаистический Комплимент".
export const DADA_VOCABULARY = [
  'ЭНТРОПИЯ', 'АБСУРД', 'СИМУЛЯКР', 'РИЗОМА', 'ДИСКУРС', 'НАРРАТИВ',
  'ГИПЕРРЕАЛЬНОСТЬ', 'ПОСТСТРУКТУРАЛИЗМ', 'ДЕКОНСТРУКЦИЯ', 'ШИЗОАНАЛИЗ',
  'БЕССОЗНАТЕЛЬНОЕ', 'АПОРИЯ', 'ТРАНСГРЕССИЯ', 'ГЕТЕРОТОПИЯ', 'ЭПИСТЕМА',
  'ПАРАДИГМА', 'КОНЦЕПТ', 'СИНГУЛЯРНОСТЬ', 'ОЗНАЧАЮЩЕЕ', 'ОЗНАЧАЕМОЕ',
  'ФАНТАСМ', 'ЖЕЛАНИЕ', 'ВЛЕЧЕНИЕ', 'СУБЪЕКТ', 'ОБЪЕКТ',
];

// Слова-обманки для третьего раунда "Поиски Картины 317"
export const distractorWords = ["ВЫРВОГЛАЗОБРАЗИЕ", "ЧРЕВОПОТОИСТЕЧЕНИЕ", 
  "ЗАДОСВЕРХПРОВОДИМОСТЬ", "ХУЛЕВЕЛИЧИЕ", "ЧРЕНДОМАНИКОЛОВИЗИЯ", 
  "СТРАХОШОКОЗАДИК", "СТРЕМОНОЖНОВЛЕЧЕНИЕ", "ПРЕИСПОДВОЛИЗАЦИЯ", 
  "ВЛАСТОВЛАЖИЕ", "ЖАБРОЖИМ", "ГАНИВАЛИГОЛАМНОГЛОЖИЕ", "НЕТРОНЕТЮЖНИЦА", 
  "АБСУРДГЛАВИЦА", "КОШКАРИДЗЕ", "МОЖЕВЫПРОГЛЯДКИ", "СЛОДОВЕЖЛИК", "ПУХТОВНИЦА", 
  "ГЛАЗОМОРДА", "УЫЖНЕРАМАСКОБЬЕВСК", "АПОНОСПОНОС", "СРАЛАНЧА", 
  "ЧУНИПАЙ", "БАЗАСРАМ", "ШЛУЯТЬ", "ПОДПУПОПИЕ", "МИКРОДОЗОПРИСТАРСТЬЕ", 
  "ИЗВОРОТОШЕЕСЛОМЩИНА", "ПРАВДОПОДОБНОЛОЖИЕ", "ПОЛУАВТОПРЕДПОДЗАКРЫВАТЕЛЬ"];

// Слова-концепции для мини-игры "Проход к кино". Они мешают игроку в 3 раунде.
export const STROITELNIE_TERMINY = [
    'АРМАТУРА', 'БЕТОН', 'ШПАТЛЕВКА', 'ГИПСОКАРТОН', 'ФУНДАМЕНТ',
    'КЕРАМЗИТ', 'РИГЕЛЬ', 'ФЕРМА', 'ОПАЛУБКА', 'ШВЕЛЛЕР', 'ЦЕМЕНТ',
    'ПЕРЕМЫЧКА', 'ФАСАД', 'АНКЕР', 'ДЮБЕЛЬ', 'КРОВЛЯ', 'ШТУКАТУРКА',
    'ГРУНТОВКА', 'СТРОПИЛА', 'ЗАМАЗКА',
];
